Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Carefully look through the messages and select the options you want to use. If you finally select "do it" the install program will carry out the actions you selected. The install program doesn't move the runtime files. They remain where you unpacked them.
es_es: Revise los mensajes con cuidado y seleccione las opciones que desea usar. Si al final selecciona «do it», el programa de instalación llevará a cabo las acciones seleccionadas. El programa de instalación no reubica los archivos de tiempo de ejecución. Permanecerán en el lugar en el que los desempaquetó.

source: In case you are not satisfied with the features included in the supplied binaries, you could try compiling Vim yourself. Get the source archive from the same location as where the binaries are. You need a compiler for which a makefile exists. Microsoft Visual C works, but is expensive. The Free Borland command-line compiler 5.5 can be used, as well as the free MingW and Cygwin compilers. Check the file src/INSTALLpc.txt for hints.
es_es: En el caso de que no esté satisfecho con las características incluidas en los binarios proporcionados, puede intentar compilar Vim. Obtenga el archivo de fuentes de la misma ubicación de los binarios. Necesitará un compilador que permita «makefiles». Microsoft Visual C funciona, pero es caro. Puede usar el compilador de línea de órdenes libre Borland 5.5, así como los compiladores libres MingW y Cygwin. Consulte el archivo «src/INSTALLpc.txt» para más indicaciones.

source: *90.3* Upgrading
es_es: *90.3* Actualizar

source: When you type "make install" the runtime files will be copied to a directory which is specific for this version. Thus they will not overwrite a previous version. This makes it possible to use two or more versions next to each other. The executable "vim" will overwrite an older version. If you don't care about keeping the old version, running "make install" will work fine. You can delete the old runtime files manually. Just delete the directory with the version number in it and all files below it. Example: >
es_es: Cuando teclea «make install», los ficheros de tiempo de ejecución se copiarán un directorio específico a la versión. Por ello, no sobreescribirán una versión anterior. Esto permite usar dos o más versiones simultáneamente. El ejecutable «vim» sobreescribirá una versión anterior. Si no le interesa preservar la versión más antigua, ejecutar «make install» funcionará sin problemas. Puede eliminar los archivos de tiempo de ejecución manualmente. Simplemente elimine el directorio con el número de versión y todos los archivos contenidos en él. Ejemplo: >

source: There are normally no changed files below this directory. If you did change the "filetype.vim" file, for example, you better merge the changes into the new version before deleting it.
es_es: Generalmente, bajo este directorio no hay archivos modificados. Si ha modificado el archivo «filetype.vim», por ejemplo, será mejor que introduzca esos cambios en la versión nueva antes de eliminar el archivo.

source: If you are careful and want to try out the new version for a while before switching to it, install the new version under another name. You need to specify a configure argument. For example: >
es_es: Si es cuidadoso y desea probar la nueva versión durante un tiempo antes de cambiar a ella, instale la nueva versión bajo otro nombre. Necesita especificar un argumento de configuración. Por ejemplo: >

source: Before running "make install", you could use "make -n install" to check that no valuable existing files are overwritten. When you finally decide to switch to the new version, all you need to do is to rename the binary to "vim". For example: >
es_es: Debería usar «make -n install» antes de ejecutar «make install» para comprobar que no se sobreescribirá ningún archivo valioso. Cuando decida pasar a la nueva versión, todo lo que necesita hacer es renombrar el binario a «vim». Por ejemplo: >

source: Upgrading is mostly equal to installing a new version. Just unpack the files in the same place as the previous version. A new directory will be created, e.g., "vim61", for the files of the new version. Your runtime files, vimrc file, viminfo, etc. will be left alone. If you want to run the new version next to the old one, you will have to do some handwork. Don't run the install program, it will overwrite a few files of the old version. Execute the new binaries by specifying the full path. The program should be able to automatically find the runtime files for the right version. However, this won't work if you set the $VIMRUNTIME variable somewhere. If you are satisfied with the upgrade, you can delete the files of the previous version. See |90.5|.
es_es: Actualizar es casi idéntico a instalar una versión nueva. Sencillamente desempaquete los archivos en la misma ubicación de la versión anterior. Se creará un directorio nuevo, esto es, «vim61», para los archivos de la versión nueva. Sus archivos de tiempo de ejecución, «vimrc» y «viminfo» no se modificarán. Si desea ejecutar la nueva versión junto a la antigua, tendrá que hacer algún trabajo manual. No ejecute el programa de instalación, ya que sobreescribirá algunos archivos de la versión antigua. Ejecute los binarios nuevos especificando la ruta completa. El programa debería averiguar automáticamente la ubicación de los archivos de tiempo de ejecución para la versión adecuada. Por otra parte, no funcionará si define en algún lugar la variable «$VIMRUNTIME». Si la actualización le satisface, puede eliminar los archivos de la versión anterior. Consulte |90.5|.

source: *90.4* Common installation issues
es_es: *90.4* Problemas de instalación habituales

source: This section describes some of the common problems that occur when installing Vim and suggests some solutions. It also contains answers to many installation questions.
es_es: Esta sección describe algunos de los problemas más habituales al instalar Vim, y sugiere algunas soluciones. También contiene respuestas a muchas preguntas sobre la instalación.

source: Q: I Do Not Have Root Privileges. How Do I Install Vim? (Unix)
es_es: P: No tengo privilegios de administrador. ¿Cómo puedo instalar Vim? (Unix)

source: This gives you a personal copy of Vim. You need to put $HOME/bin in your path to execute the editor. Also see |install-home|.
es_es: Esto genera una copia personal de Vim. Necesita poner «$HOME/bin» en su ruta (variable PATH) para ejecutar el editor. Consulte también |install-home|.

source: Q: The Colors Are Not Right on My Screen. (Unix)
es_es: P: Los colores no son los correctos en mi pantalla. (Unix)

source: If the terminal type listed is not correct, fix it. For more hints, see |06.2|. Another solution is to always use the GUI version of Vim, called gvim. This avoids the need for a correct terminal setup.
es_es: Si el tipo de terminal listado no es el correcto, corríjalo. Para más indicaciones, consulte |06.2|. Otra solución es usar siempre la versión gráfica de usuario de Vim, llamado gvim. Esto último evita la necesidad de una correcta configuración de terminal.

source: The definition of what key sends what code is very unclear for backspace <BS> and Delete <Del> keys. First of all, check your $TERM setting. If there is nothing wrong with it, try this: >
es_es: La definición del código que cada tecla envía no está muy clara con las teclas de retroceso <BS> y eliminar <Del>. Primero, compruebe su opción de configuración «$TERM». Si no detecta nada incorrecto: pruebe esto: >

source: In the first line you need to press CTRL-V and then hit the backspace key. In the second line you need to press CTRL-V and then hit the Delete key. You can put these lines in your vimrc file, see |05.1|. A disadvantage is that it won't work when you use another terminal some day. Look here for alternate solutions: |:fixdel|.
es_es: En la primera línea tiene que pulsar «CTRL-V» y después pulsar la tecla de retroceso. En la segunda, debe pulsar «CTRL-V» y pulsar la tecla de eliminar. Puede poner estas líneas en su archivo «vimrc», consulte |05.1|. Una desventaja es que no funcionará cuando use otra terminal. Consulte aquí las posibles soluciones: |:fixdel|.

source: Q: I Am Using RedHat Linux. Can I Use the Vim That Comes with the System?
es_es: P: Uso RedHat Linux. ¿Puedo usar la versión de Vim que viene con el sistema?

source: By default RedHat installs a minimal version of Vim. Check your RPM packages for something named "Vim-enhanced-version.rpm" and install that.
es_es: Por omisión, RedHat instala una versión mínima de Vim. Busque entre los paquetes RPM algo llamado «Vim-enhanced-version.rpm» e instale ese paquete.

source: Q: How Do I Turn Syntax Coloring On? How do I make plugins work?
es_es: P: ¿Como se activa el resaltado de sintaxis? ¿Como hago funcionar las extensiones?

source: Use the example vimrc script. You can find an explanation on how to use it here: |not-compatible|.
es_es: Use el script de ejemplo «vimrc». Encontrará una explicación de su uso en el siguiente apartado: |not-compatible|.

source: See the Vim-online site: http://vim.sf.net. Many users have uploaded useful Vim scripts and plugins there.
es_es: Visite el sitio web de Vim: http://vim.sf.net. Muchos usuarios han enviado útiles scripts de Vim y extensiones a esta ubicación de Internet.

source: See the Vim-online site: http://vim.sf.net. There is an archive with hints from Vim users. You might also want to search in the |maillist-archive|.
es_es: Consulte el sitio web de Vim: http://vim.sf.net. Hay un archivo con indicaciones de usuarios de Vim. Puede que también desee buscar en el archivo de la lista de correo, |maillist-archive|.

source: *90.5* Uninstalling Vim
es_es: *90.5* Desinstalar Vim

source: When you installed Vim as a package, check your package manager to find out how to remove the package again. If you installed Vim from sources you can use this command: >
es_es: Si ha instalado Vim como un paquete, compruebe su gestor de paquetes para averiguar cómo eliminar el paquete. Si ha instalado Vim a partir de las fuentes, puede usar la siguiente orden: >

source: However, if you have deleted the original files or you used an archive that someone supplied, you can't do this. Do delete the files manually, here is an example for when "/usr/local" was used as the root: >
es_es: Sin embargo, si ha eliminado los archivos originales, o ha usado un archivo que alguien le ha proporcionado, no podrá hacer esto. Este es un ejemplo de desinstalación manual de Vim cuando «/usr/local» se ha usado como el directorio raíz.

source: If you installed Vim with the self-installing archive you can run the "uninstall-gui" program located in the same directory as the other Vim programs, e.g. "c:\vim\vim61". You can also launch it from the Start menu if installed the Vim entries there. This will remove most of the files, menu entries and desktop shortcuts. Some files may remain however, as they need a Windows restart before being deleted. You will be given the option to remove the whole "vim" directory. It probably contains your vimrc file and other runtime files that you created, so be careful.
es_es: Si ha instalado Vim el archivo de instalación automática, puede ejecutar el programa «uninstall-gui», ubicado en el mismo directorio de otros programas de Vim. Esto es, «c:\vim\vim61». También puede iniciarlo desde el menú de aplicaciones si ha instalado las entradas de Vim. Esto elimina la mayoría de los archivos, entradas de menú y enlaces directos. Sin embargo, algunos archivos permanecerán en el sistema, ya que necesitan un reinicio de Windows antes de su eliminación. Se le dará la opción de eliminar todo el directorio «vim». Probablemente, contiene su archivo «vimrc» y otros archivos de tiempo de ejecución que ha creado, tenga cuidado.

source: *gui_x11.txt* For Vim version 7.2. Last change: 2007 Dec 09
es_es: *gui_x11.txt* Para Vim versión 7.2. Último cambio: 2007 Dec 09

source: Vim's Graphical User Interface *gui-x11* *GUI-X11* *Athena* *Motif* 1. Starting the X11 GUI |gui-x11-start| 2. GUI Resources |gui-resources| 3. Shell Commands |gui-pty| 4. Various |gui-x11-various| 5. GTK version |gui-gtk| 6. GNOME version |gui-gnome| 7. KDE version |gui-kde| 8. Compiling |gui-x11-compiling| 9. X11 selection mechanism |x11-selection|
es_es: Interfaz gráfica de usuario de Vim *gui-x11* *GUI-X11* *Athena* *Motif* 1. Iniciar GUI para X11 |gui-x11-start| 2. Recursos de la GUI |gui-resources| 3. Órdenes del intérprete de órdenes |gui-pty| 4. Varios |gui-x11-various| 5. Versión GTK |gui-gtk| 6. Versión GNOME |gui-gnome| 7. Versión KDE |gui-kde| 8. Compilar |gui-x11-compiling| 9. Mecanismo de selección de X11 |x11-selection|

source: ============================================================================== 1. Starting the X11 GUI *gui-x11-start* *E665*
es_es: ============================================================================== 1. Iniciando la IGU de X11 *gui-x11-start* *E665*

source: So if you call the executable "gvim", or make "gvim" a link to the executable, then the GUI version will automatically be used. Additional characters may be added after "gvim", for example "gvim-5".
es_es: Por ello, si invoca el ejecutable «gvim», o enlaza «gvim» al ejecutable, la interfaz gráfica se usará automáticamente. Se pueden añadir caracteres adicionales tras «gvim», «gvim-5» por ejemplo.

source: *gui-fork* When the GUI is started, it does a fork() and exits the current process. When gvim was started from a shell this makes the shell accept further commands. If you don't want this (e.g. when using gvim for a mail program that waits for gvim to exit), start gvim with "gvim -f", "vim -gf" or use ":gui -f". Don't use "vim -fg", because "-fg" specifies the foreground color.
es_es: *gui-fork* Cuando inicia la GUI, crea un «fork()» y termina el proceso actual. Cuando se ha iniciado gvim desde un interprete de órdenes, esto hace que la consola pueda recibir futuras órdenes. Si no desea esto, (p. ej., cuando usa gvim para un programa de correo que espera a que gvim se cierre), inicie gvim con «gvim -f», «vim -gf» o use «:gui -f». No use «vim -fg» porque «-fg» especifica el color en primer plano.

source: When using "gvim -f" and then ":gui", Vim will run in the foreground. The "-f" argument will be remembered. To force running Vim in the background use ":gui -b".
es_es: Si usa «gvim -f», y después «:gui», Vim se ejectuará en primer plano. El argumento «-f» se recordará. Para forzar que Vim se inicie de fondo, use «gui -b».

source: If you want the GUI to run in the foreground always, include the 'f' flag in 'guioptions'. |-f|.
es_es: Si desea que la IGU siempre se ejecute en primer plano, incluya la marca «f» en 'guioptions'. |-f|.

source: ============================================================================== 2. GUI Resources *gui-resources* *.Xdefaults*
es_es: ============================================================================== 2. Recursos de la IGU *gui-resources* *.Xdefaults*

source: If using the Motif or Athena version of the GUI (not for the KDE, GTK+ or Win32 version), a number of X resources are available. You should use Vim's class "Vim" when setting these. They are as follows:
es_es: En caso de que este usando la versión Motif o Athena de la IGU (no la versión de KDE, GTK+ o Win32), no dispondrá de una serie de recursos. Debería usar la clase de Vim «Vim» cuando define esto. Son como sigue:

source: Resource name Meaning ~
es_es: Nombre del recurso Significado ~

source: reverseVideo Boolean: should reverse video be used? background Color of background. foreground Color of normal text. scrollBackground Color of trough portion of scrollbars. scrollForeground Color of slider and arrow portions of scrollbars. menuBackground Color of menu backgrounds. menuForeground Color of menu foregrounds. tooltipForeground Color of tooltip and balloon foreground. tooltipBackground Color of tooltip and balloon background.
es_es: reverseVideo Boolean: ¿Se debe usar el vídeo inverso? background Color del fondo. foreground Color del texto normal. scrollBackground Color de la porción pilón de las barras de desplazamiento. scrollForeground Color de la barra y las porciones de flecha de las barras desplazamiento. menuBackground Color de fondo del menú. menuForeground Color de primer plano del menú. tooltipForeground Color de primer plano de las sugerencias y de los globos. tooltipBackground Color de fondo de las sugerencias y de los globos.

source: *gui.txt* For Vim version 7.2. Last change: 2008 Jun 14
es_es: *gui.txt* Para Vim version 7.2. Último cambio: 2008 Jun 14

source: 1. Starting the GUI |gui-start| 2. Scrollbars |gui-scrollbars| 3. Mouse Control |gui-mouse| 4. Making GUI Selections |gui-selections| 5. Menus |menus| 6. Extras |gui-extras| 7. Shell Commands |gui-shell|
es_es: 1. Iniciar la GUI |gui-start| 2. Barras de desplazamiento |gui-scrollbars| 3. Control del ratón |gui-mouse| 4. Seleccionar en la GUI |gui-selections| 5. Menús |menus| 6. Extras |gui-extras| 7. Órdenes de consola |gui-shell|

source: Other GUI documentation: |gui_x11.txt| For specific items of the X11 GUI. |gui_w32.txt| For specific items of the Win32 GUI.
es_es: Más documentación de la GUI: |gui_x11.txt| Para elementos específicos de la GUI bajo X11. |gui_w32.txt| Para elementos específicos de la GUI bajo Win32.

source: ============================================================================== 1. Starting the GUI *gui-start* *E229* *E233*
es_es: ============================================================================== 1. Iniciar la GUI *gui-start* *E229* *E233*

source: First you must make sure you actually have a version of Vim with the GUI code included. You can check this with the ":version" command, it says "with xxx GUI", where "xxx" is X11-Motif, X11-Athena, Photon, GTK, GTK2, etc., or "MS-Windows 32 bit GUI version".
es_es: Asegúrese primero de que realmente tiene una versión de Vim con el código de la GUI integrado. Puede revisar esto con la orden :version, el cual devuelve «con GUI xxx», donde «xxx» puede ser X11-Motif, X11-Athena, Photon, GTK, GTK2, etc... o «versión GUI MS-Windows 32 bit».

source: How to start the GUI depends on the system used. Mostly you can run the GUI version of Vim with: gvim [options] [files...]
es_es: Como iniciar la interfaz gráfica depende del sistema que se usa. Generalmente, puede iniciar la versión GUI de Vim con: gvim [opciones] [archivos...]

source: The X11 version of Vim can run both in GUI and in non-GUI mode. See |gui-x11-start|.
es_es: La versión X11 de Vim puede ejecutarse en modo gráfico o no. Véase |gui-x11-start|.

source: *gui-init* *gvimrc* *.gvimrc* *_gvimrc* The gvimrc file is where GUI-specific startup commands should be placed. It is always sourced after the |vimrc| file. If you have one then the $MYGVIMRC environment variable has its name.
es_es: *gui-init* *gvimrc* *.gvimrc* *_gvimrc* El archivo gvimrc es donde debe escribir las órdenes de inicio específicos de la GUI. Siempre se lee después del archivo |vimrc|. Si tiene uno, la variable de entorno $MYGVIMRC llevará su tal nombre.

source: All this happens AFTER the normal Vim initializations, like reading your .vimrc file. See |initialization|. But the GUI window is only opened after all the initializations have been carried out. If you want some commands to be executed just after opening the GUI window, use the |GUIEnter| autocommand event. Example: > :autocmd GUIEnter * winpos 100 50
es_es: Todo esto ocurre despues de las órdenes de inicio de Vim, como si leyese el archivo «.vimrc». Véase |initialization|. La ventana de la interfaz gráfica solo se abre después de llevar a cabo todas las órdenes de inicio. Si desea que alguna orden se ejecute justo después de abrir la ventana de la interfaz gráfica, use el evento de autorden |GUIEvent|. Ejemplo: > :autocmd GUIEnter * winpos 100 50

source: There are a number of options which only have meaning in the GUI version of Vim. These are 'guicursor', 'guifont', 'guipty' and 'guioptions'. They are documented in |options.txt| with all the other options.
es_es: Hay un número de opciones que solo tienen efecto en la versión GUI de Vim. Estos son 'guicursor', 'guifont', 'guipty' y 'guioptions'. Están documentadas en |options.txt|, junto con el resto de opciones.

source: Example: >
es_es: Ejemplo: >

source: *usr_26.txt* For Vim version 7.3. Last change: 2006 Apr 24
es_es: *usr_26.esx* Para Vim versión 7.3. Último cambio: 24/5/2006

source: Repeating
es_es: Repetición

source: An editing task is hardly ever unstructured. A change often needs to be made several times. In this chapter a number of useful ways to repeat a change will be explained.
es_es: Rara vez, una tarea de edición carece de estructura. A menudo tiene que realizar un cambio varias veces. En este capítulo se muestran varias maneras útiles de repetir un cambio.

source: |26.1| Repeating with Visual mode |26.2| Add and subtract |26.3| Making a change in many files |26.4| Using Vim from a shell script
es_es: |26.1| Repetir en modo Visual |26.2| Sumar y restar |26.3| Realizar un cambio en varios archivos |26.4| Usar Vim desde un script de intérprete de órdenes

source: Next chapter: |usr_27.txt| Search commands and patterns Previous chapter: |usr_25.txt| Editing formatted text Table of contents: |usr_toc.txt|
es_es: Siguiente capítulo: |usr_27.esx| Órdenes y patrones de búsqueda Capitulo anterior: |usr_24.esx| Editar otros archivos Tabla de contenidos: |usr_toc.esx|

source: *26.1* Repeating with Visual mode
es_es: *26.1* Repetición en modo Visual

source: Visual mode is very handy for making a change in any sequence of lines. You can see the highlighted text, thus you can check if the correct lines are changed. But making the selection takes some typing. The "gv" command selects the same area again. This allows you to do another operation on the same text. Suppose you have some lines where you want to change "2001" to "2002" and "2000" to "2001":
es_es: El modo Visual es útil cuando desea modificar una secuencia de líneas. Al poder ver el texto resaltado, puede revisar si las líneas a modificar lo han sido correctamente. Pero hacer la selección conlleva teclear. La orden «gv» selecciona la misma área otra vez. Esto le permite realizar otra acción sobre el texto seleccionado. Suponga que tiene algunas líneas en las que desea cambiar «2001» a «2002» y «2000» a «2001»:

source: The financial results for 2001 are better ~ than for 2000. The income increased by 50%, ~ even though 2001 had more rain than 2000. ~ 2000 2001 ~ income 45,403 66,234 ~
es_es: Los resultados financieros de 2001 son mejores ~ que para el año 2000. Los ingresos aumentaron un ~ 50%, ~ 2001, más aun cuando había más lluvia que en el 2000. ~ 2000 2001~ ingresos 45.403 66.234 ~

source: First change "2001" to "2002". Select the lines in Visual mode, and use: >
es_es: Primero cambie «2001» a ««2002». Seleccione las líneas en modo Visual y use: >

source: Now use "gv" to reselect the same text. It doesn't matter where the cursor is. Then use ":s/2000/2001/g" to make the second change. Obviously, you can repeat these changes several times.
es_es: Use ahora «gv» para seleccionar otra vez el mismo texto. No importa donde está el cursor. Use entonces «:s/2000/2001/g» para hacer el segundo cambio. Obviamente, puede repetir estos cambios varias veces.

source: *26.2* Add and subtract
es_es: *26.2* Sumar y restar

source: Now press CTRL-A. The year will be increased by one:
es_es: Ahora pulse Ctrl-A. El año se incrementará en uno:
